presentations/lessons/2023/intro-to-python.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Intro To Python</title>
<meta name="author" content="Jeetaditya Chatterjee"/>
<link rel="stylesheet" href="../../reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="../../reveal.js/dist/theme/black.css" id="theme"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1>Intro To Python</h1><h3></h3><h2>By  Jeetaditya Chatterjee</h2><h3><i>SSSSSS</i></h3><p>Press s for speaker notes</p>
</section>

<section>
<section id="slide-org5f488ac">
<h2 id="org5f488ac">What is python</h2>
<aside class="notes">
<p>
Python is a dynamic general purpose programming language.
Its used for many things including learning!
</p>

</aside>
</section>
</section>
<section>
<section id="slide-org7b9e83c">
<h2 id="org7b9e83c">Programming with python.</h2>
<aside class="notes">
<p>
you can go to python.org and install all the tools but an easier and nicer way
is to use replit.com. its pretty simple.
</p>

<p>
When you sign up, you can create a new python project, for the moment thats all
we need
</p>

</aside>
<ul>
<li class="fragment roll-in"><a href="https://python.org">https://python.org</a></li>
<li class="fragment roll-in"><a href="https://replit.com">https://replit.com</a></li>

</ul>
</section>
</section>
<section>
<section id="slide-org667f4e3">
<h2 id="org667f4e3">The first program</h2>
<aside class="notes">
<p>
The first program everyone begins with is
</p>

</aside>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #b877db;">print</span>(<span style="color: #fab795;">"hello world"</span>)
</pre>
</div>

</section>
<section id="slide-orgd2d03b5">
<h3 id="orgd2d03b5">Now lets break down what we did</h3>
<aside class="notes">
<p>
it may seem silly but it makes sense to do so
</p>

<p>
There are two main parts.
</p>

</aside>
<ul>
<li class="fragment roll-in"><code>print</code></li>

</ul>
<p>
= <code>"hello world"</code>
</p>
</section>
</section>
<section>
<section id="slide-org82b537f">
<h2 id="org82b537f">Giving names to things</h2>
<aside class="notes">
<p>
In python we can produce variables. we do this by using = operator
</p>

</aside>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #e95678;">a</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #f09383;">1</span>

<span style="color: #b877db;">print</span>(a)
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgfbeb4d2">
<h2 id="orgfbeb4d2">Maths</h2>
<aside class="notes">
<p>
Some basic maths operatiosn are as such
</p>

</aside>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #e95678;">a</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #f09383;">1</span> <span style="color: #b877db; font-style: italic;">+</span> <span style="color: #f09383;">2</span>
<span style="color: #e95678;">b</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #f09383;">1</span> <span style="color: #b877db; font-style: italic;">-</span> <span style="color: #f09383;">2</span>
<span style="color: #e95678;">c</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #f09383;">1</span> <span style="color: #b877db; font-style: italic;">/</span> <span style="color: #f09383;">2</span>
<span style="color: #e95678;">d</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #f09383;">1</span> <span style="color: #b877db; font-style: italic;">*</span> <span style="color: #f09383;">2</span>

<span style="color: #b877db;">print</span>(a, b, c, d)
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org8fc6acf">
<h2 id="org8fc6acf">A reminder</h2>
</section>
</section>
<section>
<section id="slide-org063fab7">
<h2 id="org063fab7">Expressions</h2>
<aside class="notes">
<p>
Before we move on let us discuss what an expression is,
What do people know about expressions?
</p>

<p>
They are bits of code that resolve to a value. In other words it any code you
can assign a name too
</p>

<p>
This is different from statements which tell the code what too do. We will
encounter some. but an example would be the varible assignment. Thats not
resolving to a value but telling python what to do (in this case assigning a
name to a value)
</p>

<p>
so for example
</p>

<p>
These are valid in any place that can take in a variable. In a sense variables
are also expressions.
</p>

</aside>

<ul>
<li class="fragment roll-in"><code>1 + 1 =&gt; 2</code></li>
<li class="fragment roll-in"><code>1 != 2 =&gt; True</code></li>
<li class="fragment roll-in"><code>True is True =&gt; True</code></li>
<li class="fragment roll-in"><code>math.sqrt(4) =&gt; 2</code></li>

</ul>
</section>
<section id="slide-orgfce6a84">
<h3 id="orgfce6a84">Boolean expression</h3>
<aside class="notes">
<p>
Boolean expressions are expressions that return true or false. You have probably
used them before. there are a few you need to know
</p>

</aside>
<ul>
<li class="fragment roll-in"><code>==</code></li>
<li class="fragment roll-in"><code>!=</code></li>
<li class="fragment roll-in"><code>&lt; and &gt;=</code></li>
<li class="fragment roll-in"><code>&gt; and &lt;=</code></li>
<li class="fragment roll-in"><code>is</code></li>
<li class="fragment roll-in"><code>in</code></li>

</ul>

</section>
</section>
<section>
<section id="slide-org3263a4d">
<h2 id="org3263a4d">If statements</h2>
<aside class="notes">
<p>
Now we are getting into flow control
</p>

</aside>
</section>
</section>
<section>
<section id="slide-orgd00c654">
<h2 id="orgd00c654">Types</h2>
<aside class="notes">
<p>
Types are what a variable is, it allows us to define operations on entire
classes of values, for example numbers can use the + operator and functions from
the <code>math</code> library. Strings have there own operations, other data types such as
dates or even your own types (which we will have an entire lesson on!)
</p>

<p>
The types you need to know of are&#x2026;
</p>

<p>
You can convert between these types if there is something to convert.
</p>

</aside>
<ul>
<li class="fragment roll-in">Characters</li>
<li class="fragment roll-in">Strings</li>
<li class="fragment roll-in">Ints</li>
<li class="fragment roll-in">Floats</li>
<li class="fragment roll-in">Booleans</li>
<li class="fragment roll-in">Lists</li>

</ul>
</section>
</section>
<section>
<section id="slide-org87b981d">
<h2 id="org87b981d">Lists</h2>
<aside class="notes">
<p>
Lists are what are known as a composite data type. You cannot <i>just</i> have a
list. you must have a list of <i>something</i> (unless the list is empty).
for example you can have a list of any type.
</p>

<p>
In python we can mix and match types as well. Though in your spec it may say
that they can only have one type (and in many languages which check your types
more strongly, you will get an error.)
</p>

</aside>
<ul>
<li class="fragment roll-in">[1, 2, 3]</li>
<li class="fragment roll-in">[&rsquo;a&rsquo;, &rsquo;b&rsquo;, &rsquo;c&rsquo;]</li>
<li class="fragment roll-in">[True, False, True]</li>
<li class="fragment roll-in">[1, &rsquo;a&rsquo;, False]</li>

</ul>

</section>
</section>
<section>
<section id="slide-org2b351ba">
<h2 id="org2b351ba">Loops</h2>
<aside class="notes">
<p>
Its all well and good to have a collection of values, but what if we want to use
this collection? maybe print it out?.
or more generally, how do we write code that will be run many times?
</p>

<p>
This is where loops come in. Loops are a statement that allows us to run code
many times, either a definite amount of times (for ten iterations as an example) or while a
value remains true.
</p>

</aside>
</section>
<section id="slide-org5d11cf0">
<h3 id="org5d11cf0">For loops</h3>
<aside class="notes">
<p>
There are 2 kinds of for loop you need to know about. The count controled loop
and the collection loop
</p>

</aside>
</section>
<section id="slide-orgb75d574">
<h4 id="orgb75d574">Count Controlled</h4>
<aside class="notes">
<p>
Lets say we want to iterate 10 times we can use the range construct.
This gives us a range we can move over.
</p>

</aside>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #b877db; font-style: italic;">for</span> <span style="color: #e95678;">i</span> <span style="color: #b877db; font-style: italic;">in</span> <span style="color: #b877db;">range</span>(<span style="color: #f09383;">10</span>):
    <span style="color: #b877db;">print</span>(i)
</pre>
</div>
</section>
<section id="slide-org1a65e35">
<h4 id="org1a65e35">Adding in some more details</h4>
<aside class="notes">
<p>
We can also add in an optional start value and a step, like so
</p>

</aside>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #b877db; font-style: italic;">for</span> <span style="color: #e95678;">i</span> <span style="color: #b877db; font-style: italic;">in</span> <span style="color: #b877db;">range</span>(<span style="color: #e95678;">start</span> := <span style="color: #f09383;">2</span>, <span style="color: #e95678;">stop</span> := <span style="color: #f09383;">12</span>, <span style="color: #e95678;">step</span> := <span style="color: #f09383;">2</span>):
    <span style="color: #b877db;">print</span>(i)
</pre>
</div>

</section>
