presentations/lessons/2023/intro-to-python.org
** While loops
#+begin_notes
While loops are simpler, they just need a boolean expression
These loops can run for an indefinite amount of time, because the boolean
expression may never become false
#+end_notes
#+begin_src python :results output
a = 0
while a != 10:
    print(a)
    a += 1
#+end_src

#+reveal_split:
#+begin_src python
a = 0
while a != 10:
    print(a)
# NOTE: I am not changing a
#+end_src

* Strings
#+begin_notes
Strings are a list of characters. They can act like lists but have a few of
there own operations. these include
#+end_notes
#+attr_reveal: :frag (roll-in)
- STRING.lower()
- String.upper()
- String.substring() (this one has a different syntax)
- ord (convert character to ascii number)
- chr (convert ascii number to character)
* Functions
#+begin_notes
Functions allow us to encapsulate and abstract away code. this allows us to
reuse code and abstract away implementation details.
 Here is a small example
#+end_notes

#+reveal: split
#+begin_src python :results output
def add(x, y):
    return x + y

print(add(2, 3))
#+end_src

#+RESULTS:
: 5

* Files
#+begin_notes
We have learned how to interact with values within python but what about values
outside python? Things such as files or getting input from the user?
When working with files we need to be able to
read from them
write to them

There is also a special case of writing where we will want to append to a file.


#+end_notes

#+attr_reveal: :frag (roll-in)
- read from them
- Write to them
- Append to them

** Reading files
#+begin_src python :results output
file = open("fileName.txt", "r")
file.read() # return one string of the entire file
file.seek(0) # go back to the start

# iterate through the file line by line
for line in file:
    print("line", line)
file.seek(0)

# get a list of lines to process
lines = file.readlines()

file.close() #remember to close the file after

# we cannot read from it after, we will get an error
#+end_src

: line 1
:
: line 2
:
: line 3
:

** Writing to files
#+begin_src python :results output
print("before write")
readable = open("fileName.txt", "r")
print(readable.read())
readable.close()

writable = open("fileName.txt", "w")
writable.write("4")
writable.close()

print("after write")
readable = open("fileName.txt", "r")
print(readable.read())
readable.close()
#+end_src

: before write
: 1
: 2
: 3
:
: after write
: 4

: before write
: 1
: 2
: 3
:
: before after write
: 4

** Appending to files
#+begin_src python :results output
print("before write")
readable = open("fileName.txt", "r")
print(readable.read())
readable.close()

appendable = open("fileName.txt", "a")
appendable.write("4\n")
appendable.close()

print("after write")
readable = open("fileName.txt", "r")
print(readable.read())
readable.close()
#+end_src

#+begin_example
before write
1
2
3

before after write
1
2
3
4
#+end_example

** The with statement
#+begin_src python :results output
with open("fileName.txt", "r") as file:
    print(file.read())
#+end_src

: 1
: 2
: 3
:

* Classes
#+begin_notes
We have disucssed a lot of things, If you cast your mind back we discussed
types, Those types have operations to them whether its add for numbers or the
.upper() operation for strings

Let us discuss a thought experiment.
Lets say we want to model a bin. The Bin has a few features. It tells us how
full it is. what it can store.

#+end_notes
#+attr_reveal: :frag (roll-in)
What do we need to model this bin?
