presentations/lessons/2023/intro-to-python.html
<section id="slide-org38fc5bb">
<h3 id="org38fc5bb">While loops</h3>
<aside class="notes">
<p>
While loops are simpler, they just need a boolean expression
These loops can run for an indefinite amount of time, because the boolean
expression may never become false
</p>

</aside>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #e95678;">a</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #f09383;">0</span>
<span style="color: #b877db; font-style: italic;">while</span> a <span style="color: #b877db; font-style: italic;">!=</span> <span style="color: #f09383;">10</span>:
    <span style="color: #b877db;">print</span>(a)
    <span style="color: #e95678;">a</span> <span style="color: #b877db; font-style: italic;">+=</span> <span style="color: #f09383;">1</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #e95678;">a</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #f09383;">0</span>
<span style="color: #b877db; font-style: italic;">while</span> a <span style="color: #b877db; font-style: italic;">!=</span> <span style="color: #f09383;">10</span>:
    <span style="color: #b877db;">print</span>(a)
<span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># </span><span style="color: #09f7a0; background-color: #292b36; font-weight: bold; font-style: italic;">NOTE:</span><span style="color: #6c6f93; background-color: #292b36; font-style: italic;"> I am not changing a</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgeafcf7e">
<h2 id="orgeafcf7e">Strings</h2>
<aside class="notes">
<p>
Strings are a list of characters. They can act like lists but have a few of
there own operations. these include
</p>

</aside>
<ul>
<li class="fragment roll-in">STRING.lower()</li>
<li class="fragment roll-in">String.upper()</li>
<li class="fragment roll-in">String.substring() (this one has a different syntax)</li>
<li class="fragment roll-in">ord (convert character to ascii number)</li>
<li class="fragment roll-in">chr (convert ascii number to character)</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgd80e348">
<h2 id="orgd80e348">Functions</h2>
<aside class="notes">
<p>
Functions allow us to encapsulate and abstract away code. this allows us to
reuse code and abstract away implementation details.
 Here is a small example
</p>

</aside>

</section>
<section>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #b877db; font-style: italic;">def</span> <span style="color: #87ceeb;">add</span>(<span style="color: #e95678;">x</span>, <span style="color: #e95678;">y</span>):
    <span style="color: #b877db; font-style: italic;">return</span> x <span style="color: #b877db; font-style: italic;">+</span> y

<span style="color: #b877db;">print</span>(<span style="color: #21bfc2;">add</span>(<span style="color: #f09383;">2</span>, <span style="color: #f09383;">3</span>))
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgaf9ff8d">
<h2 id="orgaf9ff8d">Files</h2>
<aside class="notes">
<p>
We have learned how to interact with values within python but what about values
outside python? Things such as files or getting input from the user?
When working with files we need to be able to
read from them
write to them
</p>

<p>
There is also a special case of writing where we will want to append to a file.
</p>

</aside>

<ul>
<li class="fragment roll-in">read from them</li>
<li class="fragment roll-in">Write to them</li>
<li class="fragment roll-in">Append to them</li>

</ul>

</section>
<section id="slide-org7ade522">
<h3 id="org7ade522">Reading files</h3>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #e95678;">file</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #b877db;">open</span>(<span style="color: #fab795;">"fileName.txt"</span>, <span style="color: #fab795;">"r"</span>)
file.<span style="color: #21bfc2; font-style: italic;">read</span>() <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># return one string of the entire file</span>
file.<span style="color: #21bfc2; font-style: italic;">seek</span>(<span style="color: #f09383;">0</span>) <span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># go back to the start</span>

<span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># iterate through the file line by line</span>
<span style="color: #b877db; font-style: italic;">for</span> <span style="color: #e95678;">line</span> <span style="color: #b877db; font-style: italic;">in</span> file:
    <span style="color: #b877db;">print</span>(<span style="color: #fab795;">"line"</span>, line)
file.<span style="color: #21bfc2; font-style: italic;">seek</span>(<span style="color: #f09383;">0</span>)

<span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># get a list of lines to process</span>
<span style="color: #e95678;">lines</span> <span style="color: #b877db; font-style: italic;">=</span> file.<span style="color: #21bfc2; font-style: italic;">readlines</span>()

file.<span style="color: #21bfc2; font-style: italic;">close</span>() <span style="color: #6c6f93; background-color: #292b36; font-style: italic;">#remember to close the file after</span>

<span style="color: #6c6f93; background-color: #292b36; font-style: italic;"># we cannot read from it after, we will get an error</span>
</pre>
</div>

<pre class="example">
line 1

line 2

line 3

</pre>

</section>
<section id="slide-org2c9b2b3">
<h3 id="org2c9b2b3">Writing to files</h3>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #b877db;">print</span>(<span style="color: #fab795;">"before write"</span>)
<span style="color: #e95678;">readable</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #b877db;">open</span>(<span style="color: #fab795;">"fileName.txt"</span>, <span style="color: #fab795;">"r"</span>)
<span style="color: #b877db;">print</span>(readable.<span style="color: #21bfc2; font-style: italic;">read</span>())
readable.<span style="color: #21bfc2; font-style: italic;">close</span>()

<span style="color: #e95678;">writable</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #b877db;">open</span>(<span style="color: #fab795;">"fileName.txt"</span>, <span style="color: #fab795;">"w"</span>)
writable.<span style="color: #21bfc2; font-style: italic;">write</span>(<span style="color: #fab795;">"4"</span>)
writable.<span style="color: #21bfc2; font-style: italic;">close</span>()

<span style="color: #b877db;">print</span>(<span style="color: #fab795;">"after write"</span>)
<span style="color: #e95678;">readable</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #b877db;">open</span>(<span style="color: #fab795;">"fileName.txt"</span>, <span style="color: #fab795;">"r"</span>)
<span style="color: #b877db;">print</span>(readable.<span style="color: #21bfc2; font-style: italic;">read</span>())
readable.<span style="color: #21bfc2; font-style: italic;">close</span>()
</pre>
</div>

<pre class="example">
before write
1
2
3

after write
4
</pre>


<pre class="example">
before write
1
2
3

before after write
4
</pre>

</section>
<section id="slide-org4a6adfc">
<h3 id="org4a6adfc">Appending to files</h3>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #b877db;">print</span>(<span style="color: #fab795;">"before write"</span>)
<span style="color: #e95678;">readable</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #b877db;">open</span>(<span style="color: #fab795;">"fileName.txt"</span>, <span style="color: #fab795;">"r"</span>)
<span style="color: #b877db;">print</span>(readable.<span style="color: #21bfc2; font-style: italic;">read</span>())
readable.<span style="color: #21bfc2; font-style: italic;">close</span>()

<span style="color: #e95678;">appendable</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #b877db;">open</span>(<span style="color: #fab795;">"fileName.txt"</span>, <span style="color: #fab795;">"a"</span>)
appendable.<span style="color: #21bfc2; font-style: italic;">write</span>(<span style="color: #fab795;">"4</span><span style="color: #b877db; font-style: italic;">\n</span><span style="color: #fab795;">"</span>)
appendable.<span style="color: #21bfc2; font-style: italic;">close</span>()

<span style="color: #b877db;">print</span>(<span style="color: #fab795;">"after write"</span>)
<span style="color: #e95678;">readable</span> <span style="color: #b877db; font-style: italic;">=</span> <span style="color: #b877db;">open</span>(<span style="color: #fab795;">"fileName.txt"</span>, <span style="color: #fab795;">"r"</span>)
<span style="color: #b877db;">print</span>(readable.<span style="color: #21bfc2; font-style: italic;">read</span>())
readable.<span style="color: #21bfc2; font-style: italic;">close</span>()
</pre>
</div>

<pre class="example" id="org4a4d759">
before write
1
2
3

before after write
1
2
3
4
</pre>

</section>
<section id="slide-orgf1674b3">
<h3 id="orgf1674b3">The with statement</h3>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #b877db; font-style: italic;">with</span> <span style="color: #b877db;">open</span>(<span style="color: #fab795;">"fileName.txt"</span>, <span style="color: #fab795;">"r"</span>) <span style="color: #b877db; font-style: italic;">as</span> file:
    <span style="color: #b877db;">print</span>(file.<span style="color: #21bfc2; font-style: italic;">read</span>())
</pre>
</div>

<pre class="example">
1
2
3

</pre>

</section>
</section>
<section>
<section id="slide-org52de2e0">
<h2 id="org52de2e0">Classes</h2>
<aside class="notes">
<p>
We have disucssed a lot of things, If you cast your mind back we discussed
types, Those types have operations to them whether its add for numbers or the
.upper() operation for strings
</p>

<p>
Let us discuss a thought experiment.
Lets say we want to model a bin. The Bin has a few features. It tells us how
full it is. what it can store.
</p>

</aside>
<p class="fragment (roll-in)">
What do we need to model this bin?
</p>
</section>
